const description = {
    "en": {
        "normal": `Your HbA1c Test value is in the ‘Normal Range’, that is Equal to or below 5.6. Let us understand a little more about this test.

HbA1c test is also called Glycosylated Hemoglobin or Glycated Hemoglobin. It is a test used to diagnose and monitor Diabetes. It tells you about the average level of your Blood Sugarover the last 3 months.

So What is Hemoglobin ? - Hemoglobin is a protein found in red blood cells. It gives blood its red color, and its function is to carry oxygen throughout your body.

The sugar in your blood is called Glucose. When glucose builds up in your blood, it binds to the Hemoglobin in your Red blood cells. Red blood cells live for about 3 months, so the test shows the average level of glucose in your blood for the past 3 months. The HbA1c test measures how much glucose is bound to the Hemoglobin. Thus, a value of 5 indicates that 5% of your Hemoglobin Proteins are Glycated.

If you don’t have Diabetes, your value will be Equal to or Below 5.6. If the value is between 5.7 to 6.4, it means you are at the onset of diabetes or you are at the risk of developing Diabetes. A value of 6.5 or more indicates Diabetes.

For more information and to Manage Diabetes better, Kindly consult your Family Doctor or your Diabetologist.`,
        
"preDia": `Your HbA1c Test value is in the ‘Pre-Diabetic’ Range, which is in between 5.7 to 6.4. Let us understand a little more about this test.

HbA1c test, also called Glycosylated Hemoglobin or Glycated Hemoglobin, is a test used to diagnose and monitor Diabetes. It tells you about the average level of your Blood Sugar over the last 3 months.

So What is Hemoglobin ? - Hemoglobin is a protein found in red blood cells. It gives blood its red color, and its function is to carry oxygen throughout your body.

The sugar in your blood is called Glucose. When glucose builds up in your blood, it binds to the Hemoglobin in your Red blood cells. Red blood cells live for about 3 months, so the test shows the average level of glucose in your blood for the past 3 months. The HbA1c test measures how much glucose is bound to the Hemoglobin. Thus a value of 5 indicates that 5% of your Hemoglobin Proteins are Glycated.

If you don’t have Diabetes, your value will be Equal to or Below 5.6. If the value is between 5.7 to 6.4, it means you are at the onset of diabetes or you are at the risk of developing Diabetes. A value of 6.5 or more indicates Diabetes.

For more information and to Manage Diabetes better, Kindly consult your Family Doctor or your Diabetologist.`,

        "dia": `Your HbA1c Test value is in the ‘Diabetic’ Range, that is ‘Equal to or More than’ 6.5. Let us understand a little more about this test.

HbA1c test, also called Glycosylated Hemoglobin or Glycated Hemoglobin, is a test used to diagnose and monitor Diabetes. It tells you about the average level of your Blood Sugar over the last 3 months.

So What is Hemoglobin ? - Hemoglobin is a protein found in red blood cells. It gives blood its red color, and its function is to carry oxygen throughout your body. 

The sugar in your blood is called Glucose. When glucose builds up in your blood, it binds to the Hemoglobin in your Red blood cells. Red blood cells live for about 3 months, so the test shows the average level of glucose in your blood for the past 3 months. The HbA1c test measures how much glucose is bound to the Hemoglobin. Thus, a value of 5 indicates that 5% of your Hemoglobin Proteins are Glycated.

If you don’t have Diabetes, your value will be Equal to or Below 5.6. If the value is between 5.7 to 6.4, it means you are at the onset of diabetes or you are at the risk of developing Diabetes. A value of 6.5 or more indicates Diabetes.

If you are already a known Diabetic, then a value of between 6 and 7 indicates Excellent Control of your Diabetes. A value of between 7 and 8 indicates medium to Good control. A Value between 8 and 10 indicates Unsatisfactory Control. A Value above 10 indicates Extremely Poor Control of Diabetes.

For more information and to Manage Diabetes better, Kindly consult your Family Doctor or your Diabetologist.`,
    },
    "hi": {
        "normal": `आपके एचबीए1सी टेस्ट का अंक नॉर्मल रेंज ’में है, यानी यह 5.6 के बराबर या उससे कम है। आइए इस परीक्षण के बारे में थोड़ा और समझें।

एचबीए1सी परीक्षण, जिसे ग्लाइकोसिलेटेड हीमोग्लोबिन या ग्लाइकेटेड हीमोग्लोबिन भी कहा जाता है, मधुमेह का निदान और निगरानी करने के लिए उपयोग किया जाने वाला एक परीक्षण है। यह आपको पिछले 3 महीनों में आपके ब्लड शुगर के औसत स्तर के बारे में बताता है।

तो हीमोग्लोबिन क्या है? - हीमोग्लोबिन एक प्रोटीन है जो लाल रक्त कोशिकाओं में पाया जाता है। यह रक्त को अपना लाल रंग देता है, और इसका कार्य आपके पूरे शरीर में ऑक्सीजन पहुंचाना है।

आपके रक्त में शुगर को ग्लूकोज कहा जाता है। जब आपके रक्त में ग्लूकोज का निर्माण होता है, तो यह आपके लाल रक्त कोशिकाओं से हीमोग्लोबिन को बांधता है। लाल रक्त कोशिकाएं लगभग 3 महीने तक जीवित रहती हैं। इस प्रकार HBA1c परीक्षण आपके रक्त में पिछले 3 महीनों के ग्लूकोज के औसत स्तर को दर्शाता है। एचबीए1सी परीक्षण यह नापता है कि कितना ग्लूकोज हेमोग्लोबिन में बंधा है। इस प्रकार, 5 के मूल्य का अर्थ है कि आपके 5 प्रतिशत हीमोग्लोबिन प्रोटीन में ग्लूकोज बंधा है।

यदि आपको मधुमेह नहीं है, तो आपका मूल्य 5 दशमलव 6 के बराबर या उससे कम होगा। यदि मूल्य 5 दशमलव 7 से 6 दशमलव 4 के बीच है, तो इसका मतलब है कि आप मधुमेह की शुरुआत में हैं या आपको मधुमेह विकसित होने का खतरा है। 6 दशमलव 5 या अधिक का अंक मधुमेह का संकेत देता है।

अधिक जानकारी के लिए और मधुमेह को बेहतर ढंग से प्रबंधित करने के लिए, कृपया अपने पारिवारिक डॉकटर या अपने मधुमेह विशेषज्ञ से परामर्श करें।`,

        "preDia": `आपके एचबीए1सी टेस्ट का अंक, प्री डायबिटिक रेंज में है, जो 5 दशमलव 7 से 6 दशमलव 4 के बीच है। आइए इस परीक्षण के बारे में थोड़ा और समझें।एचबीए1सी परीक्षण, जिसे ग्लाइकोसिलेटेड हीमोग्लोबिन या ग्लाइकेटेड हीमोग्लोबिन भी कहा जाता है, मधुमेह का निदान और निगरानी करने के लिए उपयोग किया जाने वाला एक परीक्षण है। यह आपको पिछले 3 महीनों में आपके ब्लड शुगर के औसत स्तर के बारे में बताता है।

तो हीमोग्लोबिन क्या है? - हीमोग्लोबिन एक प्रोटीन है जो लाल रक्त कोशिकाओं में पाया जाता है। यह रक्त को अपना लाल रंग देता है, और इसका कार्य आपके पूरे शरीर में ऑक्सीजन पहुंचाना है।

आपके रक्त में शुगर को ग्लूकोज कहा जाता है। जब आपके रक्त में ग्लूकोज का निर्माण होता है, तो यह आपके लाल रक्त कोशिकाओं से हीमोग्लोबिन को बांधता है। लाल रक्त कोशिकाएं लगभग 3 महीने तक जीवित रहती हैं। इस प्रकार HBA1c परीक्षण आपके रक्त में पिछले 3 महीनों के ग्लूकोज के औसत स्तर को दर्शाता है। एचबीए1सी परीक्षण यह नापता है कि कितना ग्लूकोज हेमोग्लोबिन में बंधा है। इस प्रकार, 5 के मूल्य का अर्थ है कि आपके 5 प्रतिशत हीमोग्लोबिन प्रोटीन में ग्लूकोज बंधा है।

यदि आपको मधुमेह नहीं है, तो आपका मूल्य 5 दशमलव 6 के बराबर या उससे कम होगा। यदि मूल्य 5 दशमलव 7 से 6 दशमलव 4 के बीच है, तो इसका मतलब है कि आप मधुमेह की शुरुआत में हैं या आपको मधुमेह विकसित होने का खतरा है। 6 दशमलव 5 या अधिक का अंक मधुमेह का संकेत देता है।

अधिक जानकारी के लिए और मधुमेह को बेहतर ढंग से प्रबंधित करने के लिए, कृपया अपने पारिवारिक डॉकटर या अपने मधुमेह विशेषज्ञ से परामर्श करें।
            `,
        "dia": `आपके एचबीए1सी टेस्ट का अंक, ’डायबिटिक’ रेंज में है, जो 6 दशमलव 5 के बराबर या उससे अधिक है। आइए हम इस परीक्षण के बारे में थोड़ा और समझें।

एचबीए1सी परीक्षण, जिसे ग्लाइकोसिलेटेड हीमोग्लोबिन या ग्लाइकेटेड हीमोग्लोबिन भी कहा जाता है, मधुमेह का निदान और निगरानी करने के लिए उपयोग किया जाने वाला एक परीक्षण है। यह आपको पिछले 3 महीनों में आपके ब्लड शुगर के औसत स्तर के बारे में बताता है।

तो हीमोग्लोबिन क्या है? - हीमोग्लोबिन एक प्रोटीन है जो लाल रक्त कोशिकाओं में पाया जाता है। यह रक्त को अपना लाल रंग देता है, और इसका कार्य आपके पूरे शरीर में ऑक्सीजन पहुंचाना है।

आपके रक्त में शुगर को ग्लूकोज कहा जाता है। जब आपके रक्त में ग्लूकोज का निर्माण होता है, तो यह आपके लाल रक्त कोशिकाओं से हीमोग्लोबिन को बांधता है। लाल रक्त कोशिकाएं लगभग 3 महीने तक जीवित रहती हैं। इस प्रकार HBA1c परीक्षण आपके रक्त में पिछले 3 महीनों के ग्लूकोज के औसत स्तर को दर्शाता है। एचबीए1सी परीक्षण यह नापता है कि कितना ग्लूकोज हेमोग्लोबिन में बंधा है। इस प्रकार, 5 के मूल्य का अर्थ है कि आपके 5 प्रतिशत हीमोग्लोबिन प्रोटीन में ग्लूकोज बंधा है।

यदि आपको मधुमेह नहीं है, तो आपका मूल्य 5 दशमलव 6 के बराबर या उससे कम होगा। यदि मूल्य 5 दशमलव 7 से 6 दशमलव 4 के बीच है, तो इसका मतलब है कि आप मधुमेह की शुरुआत में हैं या आपको मधुमेह विकसित होने का खतरा है। 6 दशमलव 5 या अधिक का अंक मधुमेह का संकेत देता है।

यदि आप पहले से ही एक ज्ञात मधुमेह हैं, तो 6 और 7 के बीच का अंक आपके मधुमेह के उत्तम नियंत्रण को चित्रित करता है। 7 और 8 के बीच का मूल्य मध्यम से अच्छे नियंत्रण को चित्रित करता है। 8 और 10 के बीच का अंक असंतोषजनक नियंत्रण को दर्शाता है। 10 से ऊपर का मूल्य मधुमेह के अत्यधिक खराब नियंत्रण को दर्शाता है।

अधिक जानकारी के लिए और मधुमेह को बेहतर ढंग से प्रबंधित करने के लिए, कृपया अपने पारिवारिक डॉकटर या अपने मधुमेह विशेषज्ञ से परामर्श करें।`

    },
    "mr": {
        "normal": `आपल्या एचबीए1सी चाचणीचा निकाल ‘सामान्य श्रेणी’मध्ये आहे. ते 5.6 च्या तुलनेत किंवा त्यापेक्षा कमी आहे. या चाचणी परीक्षेबद्दल थोडे अधिक समजून घेऊ या.

एचबीए1सी चाचणीला ग्लायकोसिलेटेड हीमोग्लोबिन किंवा ग्लाइकेटेड हिमोग्लोबिन देखील म्हणतात. मधुमेहाचे निदान आणि परीक्षण करण्यासाठी ही एक चाचणी आहे. हे आपल्याला गेल्या 3 महिन्यांत आपल्या रक्तातील साखरेच्या सरासरी पातळीबद्दल सांगते.

तर हिमोग्लोबिन म्हणजे काय? - हिमोग्लोबिन लाल रक्तपेशींमध्ये आढळणारः एक  प्रथिन आहे. हे रक्ताला लाल रंग देते आणि त्याचे कार्य आपल्या शरीरामध्ये ऑक्सिजन पुरविणे आहे.

तुमच्या रक्तातील साखरेला ग्लूकोज म्हणतात. जेव्हा रक्तामध्ये ग्लुकोज तयार होतो, तेव्हा तो आपल्या लाल रक्तपेशींमधील हिमोग्लोबिनशी बांधला जातो. लाल रक्त पेशी जवळजवळ 3 महिने जिवंत असतात. म्हणूनच ही चाचणी गेल्या 3 महिन्यांपासूनची रक्तातील ग्लूकोजची सरासरी पातळी दर्शविते. एचबीए1सी ही चाचणी हेमोग्लोबिनला किती ग्लूकोज बांधील आहे, याचे मोजमाप करते. अशा प्रकारे, 5 हा अंक सूचित करतो की आपल्या शरीरामध्ये 5% हिमोग्लोबिन प्रथिने ग्लाइकेटेड आहेत.

आपल्याला मधुमेह नसल्यास, आपल्या एचबीए1सी चाचणीचा निकाल अंक, 5.6 च्या समान किंवा 5.6 च्या खाली असेल. जर अंक 5.7 आणि 6.4 च्या दरम्यान असेल, तर याचा अर्थ असा की आपण मधुमेहाच्या सुरुवातीस आहात किंवा मधुमेह होण्याचा धोका आहे. 6.5 किंवा त्याहून अधिक अंक मधुमेह दर्शवितो.

अधिक माहितीसाठी आणि मधुमेह अधिक चांगल्याप्रकारे नियंत्रण करण्यासाठी कृपया आपल्या फॅमिली डॉक्टार किंवा मधुमेह तज्ञाचा सल्ला घ्या.`,

        "preDia": `आपल्या एचबीए1सी चाचणीचा निकाल ‘प्री-डायबेटिक’ श्रेणीमध्ये आहे, जे 5.7 ते 6.4 दरम्यान आहे.  या चाचणी परीक्षेबद्दल थोडे अधिक समजून घेऊ या.

एचबीए1सी चाचणीला ग्लायकोसिलेटेड हीमोग्लोबिन किंवा ग्लाइकेटेड हिमोग्लोबिन देखील म्हणतात. मधुमेहाचे निदान आणि परीक्षण करण्यासाठी ही एक चाचणी आहे. हे आपल्याला गेल्या 3 महिन्यांत आपल्या रक्तातील साखरेच्या सरासरी पातळीबद्दल सांगते.

तर हिमोग्लोबिन म्हणजे काय? - हिमोग्लोबिन लाल रक्तपेशींमध्ये आढळणारः एक  प्रथिन आहे. हे रक्ताला लाल रंग देते आणि त्याचे कार्य आपल्या शरीरामध्ये ऑक्सिजन पुरविणे आहे.

तुमच्या रक्तातील साखरेला ग्लूकोज म्हणतात. जेव्हा रक्तामध्ये ग्लुकोज तयार होतो, तेव्हा तो आपल्या लाल रक्तपेशींमधील हिमोग्लोबिनशी बांधला जातो. लाल रक्त पेशी जवळजवळ 3 महिने जिवंत असतात. म्हणूनच ही चाचणी गेल्या 3 महिन्यांपासूनची रक्तातील ग्लूकोजची सरासरी पातळी दर्शविते. एचबीए1सी ही चाचणी हेमोग्लोबिनला किती ग्लूकोज बांधील आहे, याचे मोजमाप करते. अशा प्रकारे, 5 हा अंक सूचित करतो की आपल्या शरीरामध्ये 5% हिमोग्लोबिन प्रथिने ग्लाइकेटेड आहेत.

आपल्याला मधुमेह नसल्यास, आपल्या एचबीए1सी चाचणीचा निकाल अंक, 5.6 च्या समान किंवा 5.6 च्या खाली असेल. जर अंक 5.7 आणि 6.4 च्या दरम्यान असेल, तर याचा अर्थ असा की आपण मधुमेहाच्या सुरुवातीस आहात किंवा मधुमेह होण्याचा धोका आहे. 6.5 किंवा त्याहून अधिक अंक मधुमेह दर्शवितो.

अधिक माहितीसाठी आणि मधुमेह अधिक चांगल्याप्रकारे नियंत्रण करण्यासाठी कृपया आपल्या फॅमिली डॉक्टार किंवा मधुमेह तज्ञाचा सल्ला घ्या.`,

        "dia": `आपल्या एचबीए1सी चाचणीचा निकाल ‘डायबेटिक’ श्रेणीमध्ये आहे. ते 6.5 च्या समान किंवा 6.5 चपेक्षा अधिक आहे. या चाचणी परीक्षेबद्दल थोडे अधिक समजून घेऊ या.

एचबीए1सी चाचणीला ग्लायकोसिलेटेड हीमोग्लोबिन किंवा ग्लाइकेटेड हिमोग्लोबिन देखील म्हणतात. मधुमेहाचे निदान आणि परीक्षण करण्यासाठी ही एक चाचणी आहे. हे आपल्याला गेल्या 3 महिन्यांत आपल्या रक्तातील साखरेच्या सरासरी पातळीबद्दल सांगते.

तर हिमोग्लोबिन म्हणजे काय? - हिमोग्लोबिन लाल रक्तपेशींमध्ये आढळणारः एक प्रथिन आहे. हे रक्ताला लाल रंग देते आणि त्याचे कार्य आपल्या शरीरामध्ये ऑक्सिजन पुरविणे आहे.

तुमच्या रक्तातील साखरेला ग्लूकोज म्हणतात. जेव्हा रक्तामध्ये ग्लुकोज तयार होतो, तेव्हा तो आपल्या लाल रक्तपेशींमधील हिमोग्लोबिनशी बांधला जातो. लाल रक्त पेशी जवळजवळ 3 महिने जिवंत असतात. म्हणूनच ही चाचणी गेल्या 3 महिन्यांपासूनची रक्तातील ग्लूकोजची सरासरी पातळी दर्शविते. एचबीए1सी ही चाचणी हेमोग्लोबिनला किती ग्लूकोज बांधील आहे, याचे मोजमाप करते. अशा प्रकारे, 5 हा अंक सूचित करतो की आपल्या शरीरामध्ये 5% हिमोग्लोबिन प्रथिने ग्लाइकेटेड आहेत.

आपल्याला मधुमेह नसल्यास, आपल्या एचबीए1सी चाचणीचा निकाल अंक, 5.6 च्या समान किंवा 5.6 च्या खाली असेल. जर अंक 5.7 आणि 6.4 च्या दरम्यान असेल, तर याचा अर्थ असा की आपण मधुमेहाच्या सुरुवातीस आहात किंवा मधुमेह होण्याचा धोका आहे. 6.5 किंवा त्याहून अधिक अंक मधुमेह दर्शवितो.

जर आधीपासूनच आपण मधुमेही असाल, तर 6 ते 7 दरम्यानचा चाचणीचा अंक आपल्या मधुमेहाचे उत्कृष्ट नियंत्रण दर्शवते. 7 आणि 8 मधील चाचणीचा अंक मध्यम ते चांगल्या नियंत्रणाचे सूचित करते. 8 आणि 10 मधील चाचणीचा अंक असमाधानकारक नियंत्रण दर्शवते. 10 वरील चाचणीचा अंक मधुमेहाचे अत्यंत खराब नियंत्रण सूचित करते.

अधिक माहितीसाठी आणि मधुमेह अधिक चांगल्याप्रकारे नियंत्रण करण्यासाठी कृपया आपल्या फॅमिली डॉक्टार किंवा मधुमेह तज्ञाचा सल्ला घ्या.`
    },



    "gu": {
        "normal": `તમારું એચબીએ1સી પરીક્ષણ મૂલ્ય ‘સામાન્ય રેન્જ’ માં છે, જે 5.6 ની બરાબર અથવા નીચે છે. 
ચાલો આ પરીક્ષણ વિશે થોડું વધારે સમજીએ.

એચબીએ1સી પરીક્ષણને ગ્લાયકોસાઇલેટેડ હિમોગ્લોબિન અથવા ગ્લાયકેટેડ હિમોગ્લોબિન પણ કહેવામાં આવે છે. તે ડાયાબિટીઝના નિદાન અને નિરીક્ષણ માટે વપરાયેલ એક પરીક્ષણ છે. તે તમને છેલ્લા 3 મહિનામાં તમારા બ્લડ સુગરના સરેરાશ સ્તર વિશે જણાવે છે.

તો હિમોગ્લોબિન શું છે? - હિમોગ્લોબિન એ લાલ રક્તકણોમાં જોવા મળતું પ્રોટીન છે. તે લોહીને લાલ રંગ આપે છે, અને તેનું કાર્ય તમારા આખા શરીરમાં ઓક્સિજન વહન કરવાનું છે.

તમારા લોહીમાં ખાંડને ગ્લુકોઝ કહેવામાં આવે છે. જ્યારે તમારા લોહીમાં ગ્લુકોઝ બને છે, ત્યારે તે તમારા લાલ રક્તકણોમાં હિમોગ્લોબિન સાથે જોડાય છે. લાલ રક્ત કોશિકાઓ લગભગ 3 મહિના સુધી જીવંત રહે છે, તેથી આ પરીક્ષણ છેલ્લા 3 મહિનાથી તમારા લોહીમાં ગ્લુકોઝનું સરેરાશ સ્તર દર્શાવે છે. એચબીએ 1 સી પરીક્ષણ માપે છે કે હિમગ્લોબિન માટે કેટલું ગ્લુકોઝ બંધાયેલ છે. આમ, 5 નું મૂલ્ય સૂચવે છે કે તમારા 5% હિમોગ્લોબિન પ્રોટીન ગ્લાઇકેટેડ છે.

જો તમને ડાયાબિટીઝ નથી, તો તમારું મૂલ્ય 5.6 ની બરાબર અથવા નીચું હશે. જો કિંમત 5.6 થી 6.4. ની વચ્ચે હોય, તો તેનો અર્થ એ કે તમે ડાયાબિટીઝની શરૂઆત પર છો અથવા તમને ડાયાબિટીઝ થવાનું જોખમ છે. 6.5 અથવા તેથી વધુની કિંમત ડાયાબિટીઝ સૂચવે છે.

વધુ માહિતી માટે અને ડાયાબિટીઝને વધુ સારી રીતે સંચાલિત કરવા માટે, કૃપા કરીને તમારા ફેમિલી ડોક્ટર અથવા તમારા ડાયાબિટીસના નિષ્ણાતની સલાહ લો.`,

        "preDia": `તમારું એચબીએ 1 સી પરીક્ષણ મૂલ્ય ‘પ્રિ-ડાયાબિટીક’ રેંજમાં છે, જે 5.7 થી 6.4 ની વચ્ચે છે. ચાલો આ પરીક્ષણ વિશે થોડું વધારે સમજીએ.

એચબીએ 1 સી પરીક્ષણ, જેને ગ્લાયકોસાઇલેટેડ હિમોગ્લોબિન અથવા ગ્લાયકેટેડ હિમોગ્લોબિન પણ કહેવામાં આવે છે, તે ડાયાબિટીઝના નિદાન અને નિરીક્ષણ માટે વપરાયેલ પરીક્ષણ છે. તે તમને છેલ્લા 3 મહિનામાં તમારા બ્લડ સુગરના સરેરાશ સ્તર વિશે જણાવે છે.

તો હિમોગ્લોબિન શું છે? - હિમોગ્લોબિન એ લાલ રક્તકણોમાં જોવા મળતું પ્રોટીન છે. તે લોહીને લાલ રંગ આપે છે, અને તેનું કાર્ય તમારા આખા શરીરમાં ઓક્સિજન વહન કરવાનું છે.

તમારા લોહીમાં ખાંડને ગ્લુકોઝ કહેવામાં આવે છે. જ્યારે તમારા લોહીમાં ગ્લુકોઝ બને છે, ત્યારે તે તમારા લાલ રક્તકણોમાં હિમોગ્લોબિન સાથે જોડાય છે. લાલ રક્ત કોશિકાઓ લગભગ 3 મહિના સુધી જીવંત રહે છે, તેથી આ પરીક્ષણ છેલ્લા 3 મહિનાથી તમારા લોહીમાં ગ્લુકોઝનું સરેરાશ સ્તર દર્શાવે છે. એચબીએ 1 સી પરીક્ષણ માપે છે કે હિમગ્લોબિન માટે કેટલું ગ્લુકોઝ બંધાયેલ છે. આમ 5 નું મૂલ્ય સૂચવે છે કે તમારા 5% હિમોગ્લોબિન પ્રોટીન ગ્લાયકેટેડ છે.

જો તમને ડાયાબિટીઝ નથી, તો તમારું મૂલ્ય 5.6 ની બરાબર અથવા નીચું હશે. જો કિંમત 5.6 થી 6.4. ની વચ્ચે હોય, તો તેનો અર્થ એ કે તમે ડાયાબિટીઝની શરૂઆત પર છો અથવા તમને ડાયાબિટીઝ થવાનું જોખમ છે. 6.5 અથવા તેથી વધુની કિંમત ડાયાબિટીઝ સૂચવે છે.

વધુ માહિતી માટે અને ડાયાબિટીઝને વધુ સારી રીતે સંચાલિત કરવા માટે, કૃપા કરીને તમારા ફેમિલી ડોક્ટર અથવા તમારા ડાયાબિટીસના નિષ્ણાતની સલાહ લો.`,

        "dia": `તમારું એચબીએ 1 સી પરીક્ષણ મૂલ્ય ‘ડાયાબિટીક’ રેન્જમાં છે, જે ‘6.5 ની સમાન અથવા વધુ છે’. ચાલો આ પરીક્ષણ વિશે થોડું વધારે સમજીએ.

એચબીએ 1 સી પરીક્ષણ, જેને ગ્લાયકોસાઇલેટેડ હિમોગ્લોબિન અથવા ગ્લાયકેટેડ હિમોગ્લોબિન પણ કહેવામાં આવે છે, તે ડાયાબિટીઝના નિદાન અને નિરીક્ષણ માટે વપરાયેલ પરીક્ષણ છે. તે તમને છેલ્લા 3 મહિનામાં તમારા બ્લડ સુગરના સરેરાશ સ્તર વિશે જણાવે છે.

તો હિમોગ્લોબિન શું છે? - હિમોગ્લોબિન એ લાલ રક્તકણોમાં જોવા મળતું પ્રોટીન છે. તે લોહીને લાલ રંગ આપે છે, અને તેનું કાર્ય તમારા આખા શરીરમાં ઓક્સિજન વહન કરવાનું છે.

તમારા લોહીમાં ખાંડને ગ્લુકોઝ કહેવામાં આવે છે. જ્યારે તમારા લોહીમાં ગ્લુકોઝ બને છે, ત્યારે તે તમારા લાલ રક્તકણોમાં હિમોગ્લોબિન સાથે જોડાય છે. લાલ રક્ત કોશિકાઓ લગભગ 3 મહિના સુધી જીવંત રહે છે, તેથી આ પરીક્ષણ છેલ્લા 3 મહિનાથી તમારા લોહીમાં ગ્લુકોઝનું સરેરાશ સ્તર દર્શાવે છે. એચબીએ 1 સી પરીક્ષણ માપે છે કે હિમગ્લોબિન માટે કેટલું ગ્લુકોઝ બંધાયેલ છે. આમ, 6 નું મૂલ્ય સૂચવે છે કે તમારા હિમોગ્લોબિન પ્રોટીનનો 6% ગ્લાયકેટેડ છે.

જો તમને ડાયાબિટીઝ નથી, તો તમારું મૂલ્ય 5.6 ની બરાબર અથવા નીચું હશે. જો કિંમત 5..6 થી .4..4 ની વચ્ચે હોય, તો તેનો અર્થ એ કે તમે ડાયાબિટીઝની શરૂઆત પર છો અથવા તમને ડાયાબિટીઝ થવાનું જોખમ છે. 6.5 અથવા તેથી વધુની કિંમત ડાયાબિટીઝ સૂચવે છે.

જો તમે પહેલેથી જ ડાયાબિટીઝના જાણીતા છો, તો પછી 6 અને 7 ની વચ્ચેનું મૂલ્ય તમારી ડાયાબિટીઝના ઉત્તમ નિયંત્રણને સૂચવે છે.
7 અને 8 ની વચ્ચેનું મૂલ્ય મધ્યમથી સારા નિયંત્રણને સૂચવે છે. 
8 અને 10 ની વચ્ચેનું મૂલ્ય અસંતોષકારક નિયંત્રણ સૂચવે છે. 
10 થી ઉપરની કિંમત ડાયાબિટીઝના અત્યંત નબળા નિયંત્રણને સૂચવે છે.

વધુ માહિતી માટે અને ડાયાબિટીઝને વધુ સારી રીતે સંચાલિત કરવા માટે, કૃપા કરીને તમારા ફેમિલી ડોક્ટર અથવા તમારા ડાયાબિટીસના નિષ્ણાતની સલાહ લો.`
    },
};
export default description;
